package ex03_박건아;

public class Ex03 {

	public static void main(String[] args) {
//		문제 3. 정수 배열에서 최대값과 최소값을 출력하는 메소드를 작성하려고한다. (20점)
//
//		코드 작성없이 한글로 로직구성만 하되, 메소드 정의 방법에 따라 순서 맞춰 작성하세요.
		
		// 1) 기능 생각 -> 정수 배열에서 최대값과 최소값을 출력하는 메소드를 작성
		// 2) 메소드명 -> numMaxMin
		// 3) 리턴타입 -> void
		// 4) 매개변수 정수형 배열 1개 선언 int[] num <- 여기까지 선언부
		// 5) 최대값을 담을 정수형 변수 1개 int max = num[0]; -< 구현부 시작
		// 5-1) 최소값을 담을 정수형 변수 1개 선언 int min = num[0];
		// 6) for문을 이용해 전달받은 값으로 정수형 배열을 채운다
		// 6-1) 초기식  int i = 0; 조건식 i <= 배열명.length; 증감식 i++
		// 6-2) for문 안쪽 실행문장 배열명[i] = i;
		// 7) if (배열명[i] < i){
		// 7-1) max = num[i];}
		// 8) if (배열명[i] > i){
		// 8-1) min = num[i];}
		// 9 for문} syso(max) syso(min)
		// 10 리턴값이 없어 리턴타입수정 x
		}
		

	}


